#!/usr/local/bin/python3

banner = """
  ================================================================  
  ================================================================  
  ================================================================  
  ================================================================  
     ---          --             --             --          ---     
     ---          --             --             --          ---     
     ---          --        +====--====+        --          ---     
     ---          --      +======--=======      --          ---     
     ---          --    +========--========+    --          ---     
     ---          --   %#########--#########%   --          ---     
     ---          --  %%%%%%%%%%%--%%%%%%%%%%%  --          ---     
     ---          --  %%%%%%%%%%%--%%%%%%%%%%%  --          ---     
     ---          -- ============--============ --          ---     
     ---          -- ============--============ --          ---     
     ---          -- ============--============ --          ---     
     ---          -- %%%%%%%%%%%%--%%%%%%%%%%%% --          ---     
     ---          --%%%%%%%%%%%%%--%%%%%%%%%%%%%--          ---     
     ---          --%%%%%%%%%%%%%--%%%%%%%%%%%%%--          ---     
     ---          -- %%%%%%%%%%%%--%%%%%%%%%%%% --          ---     
     ---          --  %%%%%%%%%%%--%%%%%%%%%%%  --          ---     
     ---          --     %%%%%%%%--%%%%%%%%     --          ---     
     ---          --      %%%%%%%--%%%%%%%      --          ---     
     ---          --       %%%%%%--%%%%%%       --          ---     
     ---          --       %%%%%%--%%%%%%       --          ---     
     ---          -- +=====+%%%%%--%%%%%*=====+ --          ---     
     ---         +--========#%%%%--%%%%#+=======--+         ---     
     ---      +===--=========+#%%--%%%+=========--===+      ---     
     ---     =====--===========+%--%+===========--=====     ---     
     ---    #*****--*************--*************--******    ---     
     ---   %%%%%%%--%%%%%%%%%%%%%--%%%%%%%%%%%%%--%%%%%%%   ---     
     ---  %%%%%%%%--%%%%%%%%%%%%%--%%%%%%%%%%%%%--%%%%%%%%  ---     
  =========+++++++==+++++++++++++==+++++++++++++==+++++++=========  
  ================================================================  
  ================================================================  
  ================================================================  

  Given a limited character set and limited execution, try to read "flag.txt" from the system!
"""

# No opening files for you!
open = None

# and no letters for you!!!
def is_allowed(your_code):
  blacklist = set("abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ ") # no whitespace too hehe
  for c in your_code:
     if c in blacklist: return False
  return True

MAX_CODE_SIZE = 30
def jail3():
    print("You made it here? Fine, I guess i'll just remove the entire alphabet from you...")
    print("You get 15 characters only this time")
    your_code = input("> ")
    if(len(your_code) > MAX_CODE_SIZE):
        print("nope nope nope nope, too many characters: ", len(your_code))
    elif not is_allowed(your_code):
       print("no alphabet allowed!")
    else:
      print(f"Your code has {len(your_code)} characters, go ahead and run it")

      # Whatever, I'll just delete all the builtins!
      eval(your_code, {"__builtins__": {}})

if __name__ == "__main__":
    print(banner)
    jail3()

"""
𝔪𝔶_𝔢𝔳𝔞𝔩(𝔦𝔫𝔭𝔲𝔱())
𝔪𝔶_𝔢𝔳𝔞𝔩("1+1")

ｅｖａｌ(ｉｎｐｕｔ())
ｍｙ_ｅｖａｌ("1+1")
𝚙𝚛𝚒𝚗𝚝(3)
"""